In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [5]:
dframe1 = DataFrame({"key1": ["A"] * 2 + ["B"] * 3,
                    "key2": [2, 2, 2, 3, 3]})
dframe1

  key1  key2
0    A     2
1    A     2
2    B     2
3    B     3
4    B     3

In [9]:
# are these rows duplicates?
dframe1.duplicated()

0    False
1     True
2    False
3    False
4     True
dtype: bool

In [11]:
dframe1.drop_duplicates()

  key1  key2
0    A     2
2    B     2
3    B     3

In [13]:
# drops duplicates in key1 column
dframe1.drop_duplicates("key1")

  key1  key2
0    A     2
2    B     2

In [15]:
dframe1

  key1  key2
0    A     2
1    A     2
2    B     2
3    B     3
4    B     3

In [25]:
# drop duplicates in key1 column, but keep the last occurences of duplicates---compare with original
dframe1.drop_duplicates("key1", keep = "last")

  key1  key2
1    A     2
4    B     3